const nation = prompt("Ким будеш? Від кого прийшов?");

if (nation === "Свій") {
    console.log("Ай молодець! :)");
    
} else if (nation === "Литвин") {
    console.log("Раді тебе бачити, друже. Проходь");
} else if (nation === "Німчин") {
    console.log("Шпрехен зі дейч? Вількомен, шановний");
} else if (nation === "Гішпанець") {
    console.log("Лінгва латіна шпрехаєш? Ну, проходь собі, буеньчику");
} else if (nation === "З Московії я") {
    console.log("А хто це у нас тут такий! Москалик. На гілляку його, братці!")
} else if (nation === "Єстем з жечі посполітой") {
    console.log("Ти ба? З жечі, кажеш? То нехай. А ну вгодіть посполитому пану: зжечь ляха!")
}